---
kind: property
id: P:Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Caption
source: html/1ea0706c-ed5c-91fb-5c01-85c3dec9cdf0.htm
---
# Autodesk.Revit.DB.Events.ProgressChangedEventArgs.Caption Property

The text from the progress bar caption that describes the operation in progress

## Syntax (C#)
```csharp
public string Caption { get; }
```